import { Quiz } from '@models/quiz';

export const QUIZ_CONTENT: Quiz = {
    id: 0,
    subject: 'paycheck',
    questions: [
        {
            id: 0,
            title: 'מהו תלוש שכר?',
            possibleAnswers: [
                'מסמך המתאר את כל ההכנסות וההוצאות של העובד',
                'מסמך המפרט את תנאי העסקה של העובד',
                'מסמך המציג את פירוט התשלום שהעובד קיבל ואת הניכויים ממנו',
                'מסמך שהמעסיק מגיש למס הכנסה',
            ],
            correctAnswerId: 2,
            explanation:
                'תלוש שכר מפרט את השכר ברוטו, ניכויים שונים ושכר הנטו.',
        },
        {
            id: 1,
            title: 'מה מסמל המושג “ברוטו” בתלוש שכר?',
            possibleAnswers: [
                'ההכנסה הכוללת לפני ניכויים',
                'ההכנסה לאחר ניכויים',
                'רק תוספות מיוחדות',
                'תשלום המס בלבד',
            ],
            correctAnswerId: 0,
            explanation: 'ברוטו הוא סכום השכר לפני הורדת מיסים וניכויים.',
        },
        {
            id: 2,
            title: 'מהו “נטו” בתלוש השכר?',
            possibleAnswers: [
                'ההכנסה לאחר כל הניכויים',
                'ההכנסה לפני ניכויים',
                'תשלומים נוספים שהעובד מקבל',
                'רק ההוצאות שמנוכות מהשכר',
            ],
            correctAnswerId: 0,
            explanation: 'נטו הוא הסכום שהעובד מקבל בפועל.',
        },
        {
            id: 3,
            title: 'איזה סעיף בתלוש השכר מפרט את מספר שעות העבודה?',
            possibleAnswers: [
                'פירוט ברוטו',
                'פירוט שעות ונוכחות',
                'ניכויים',
                'נסיעות',
            ],
            correctAnswerId: 1,
            explanation: 'סעיף זה מציג את שעות העבודה של העובד.',
        },
    ],
};
